note/2019/jump-back-in-emacs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-03 Sat 13:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Jump Back in Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../index.html"> HOME </a>
</div>
<div>
<a href="../index.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Jump Back in Emacs</h1>
<p>
It is annoying when you jumped to somewhere, did some operations and couldn’t find the way back and have to scroll back or jump back by searching. There are many position history packages that record your location and let you jump back in time. But in reality they either set too much anchors or didn’t set the anchor you need. Also jumping between anchors are more or less visually confusing because you have to observe where are you after each jump. In a word, the experience is not very good.
</p>

<p>
After some observation I found that the annoying situation I described above only takes place after a very limited set of commands: <code>beginning-of-buffer</code>, <code>end-of-buffer</code>, <code>helm-swoop</code>, <code>query-replace</code>, <code>replace-string</code>, <code>isearch</code>. (<code>x-ref</code> has its own jump back command.)
</p>

<p>
I wrote my jump back command that only records position before these commands, so when I invoke the jump I always know where am I going. Also, if I jump back after jumped back, I jump back to where I was before I jump back the first time ;-)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4078f2;">(</span><span style="color: #e45649;">defvar</span> <span style="color: #6a1868;">luna-jump-back-marker</span> nil
  <span style="color: #9ca0a4; font-style: italic;">"Marker set for `</span><span style="color: #b751b6; font-style: italic;">luna-jump-back</span><span style="color: #9ca0a4; font-style: italic;">'."</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">defvar</span> <span style="color: #6a1868;">luna-jump-back-monitored-command-list</span>
  '<span style="color: #a626a4;">(</span>isearch-forward helm-swoop isearch-backward end-of-buffer beginning-of-buffer query-replace replace-string<span style="color: #a626a4;">)</span>
  <span style="color: #9ca0a4; font-style: italic;">"Commands in this list sets mark before execution for jumping back later."</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">defun</span> <span style="color: #a626a4;">luna-jump-back</span> <span style="color: #a626a4;">()</span>
  <span style="color: #9ca0a4; font-style: italic;">"Jump back to previous position."</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">interactive</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span>not luna-jump-back-marker<span style="color: #50a14f;">)</span>
      <span style="color: #50a14f;">(</span>message <span style="color: #50a14f;">"No marker set"</span><span style="color: #50a14f;">)</span>
    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">set `</span><span style="color: #b751b6;">luna-jump-back-marker</span><span style="color: #9ca0a4;">' to point and jump back</span>
    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">so we can keep jumping back and forth</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">let</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span>here <span style="color: #986801;">(</span>point-marker<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
          <span style="color: #b751b6;">(</span>there luna-jump-back-marker<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">setq</span> luna-jump-back-marker here<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span>goto-char there<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">defun</span> <span style="color: #a626a4;">luna-maybe-set-marker-to-jump-back</span> <span style="color: #a626a4;">()</span>
  <span style="color: #9ca0a4; font-style: italic;">"Set marker to jump back if this command is search or jump."</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">when</span> <span style="color: #50a14f;">(</span>member this-command luna-jump-back-monitored-command-list<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">setq</span> luna-jump-back-marker <span style="color: #da8548;">(</span>point-marker<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>add-hook 'pre-command-hook #'luna-maybe-set-marker-to-jump-back<span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu <<a href="mailto:casouri@gmail.com">casouri@gmail.com</a>></p>
<p class="first-publish">First Published on 2019-08-03 Sat 12:52</p>
<p class-"last-modified">Last modified on 2019-08-03 Sat 13:32</p>
</div>
</body>
</html>
